tap "homebrew/bundle"
tap "hashicorp/tap"

brew "docker-buildx"
brew "fd"
brew "fzf"
brew "hashicorp/tap/vault"
brew "helm"
brew "kind"
brew "kubectl"
brew "lf"
brew "mas"
brew "neovim"
brew "shellcheck"
brew "thefuck"
brew "tree"
brew "zellij"
brew "zsh"

cask "alfred"
cask "bitwarden"
cask "docker"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "logi-options+"
cask "obsidian"
cask "rectangle"
cask "spotify"

mas "Amphetamine", id: 937984704
mas "MonitorControl Lite", id: 1595464182
mas "Todoist", id: 585829637
mas "Yoink", id: 457622435

vscode "aaron-bond.better-comments"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hogashi.vscode-copy-github-permalink"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "takumii.markdowntable"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
