tap "homebrew/bundle"

brew "docker-buildx"
brew "fd"
brew "fzf"
brew "gh"
brew "helm"
brew "kind"
brew "kubectl"
brew "lf"
brew "luarocks"
brew "mas"
brew "mac-mouse-fix"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "shellcheck"
brew "tree"
brew "uv"
brew "zellij"
brew "zsh"

cask "alfred"
cask "bitwarden"
cask "cursor"
cask "docker"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "obsidian"
cask "rectangle"

mas "Amphetamine", id: 937984704
mas "MonitorControl Lite", id: 1595464182
mas "Todoist", id: 585829637
mas "Yoink", id: 457622435

vscode "aaron-bond.better-comments"
vscode "ms-python.black-formatter"
vscode "EditorConfig.EditorConfig"
vscode "tamasfe.even-better-toml"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "codezombiech.gitignore"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "oderwat.indent-rainbow"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "KevinRose.vsc-python-indent"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "vscodevim.vim"
vscode "GitHub.vscode-pull-request-github"
vscode "yzhang.markdown-all-in-one"
