tap "homebrew/bundle"

brew "docker-buildx"
brew "fd"
brew "fzf"
brew "helm"
brew "kind"
brew "kubectl"
brew "lf"
brew "mas"
brew "neovim"
brew "shellcheck"
brew "tree"
brew "uv"
brew "zellij"
brew "zsh"

cask "alfred"
cask "bitwarden"
cask "docker"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "logi-options+"
cask "obsidian"
cask "rectangle"
cask "spotify"

mas "Amphetamine", id: 937984704
mas "MonitorControl Lite", id: 1595464182
mas "Todoist", id: 585829637
mas "Yoink", id: 457622435
