tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "font-hack-nerd-font"
brew "git"
brew "lf"
brew "neovim"
brew "nvm"
brew "reattach-to-user-namespace"
brew "python@3.11"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"

cask "alfred"
cask "bitwarden"
cask "docker"
cask "iterm2"
cask "rectangle"
cask "visual-studio-code"
